Revit.Elements.ElementSelector.ByElementId(System.Int64,System.Boolean)
A factory method for looking up and obtaining elements
from the revit project.
elementId: The id of the element to select
isRevitOwned: Whether the returned object should be revit owned or not
Returns:

Revit.Elements.ElementSelector.InternalGetElementById(System.Int64)
Internal helper method to get an element from the current document by id
id:
Returns: